In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data_hw_01/adult.data.csv', names=['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status',
                                                'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss',
                                                'hours-per-week', 'native-country', 'salary'])

In [3]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

**1. Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?**

In [5]:
df['sex'].value_counts()

 Male      21790
 Female    10771
Name: sex, dtype: int64

**2. Каков средний возраст (признак age) женщин?**

In [6]:
df['sex'].unique()

array([' Male', ' Female'], dtype=object)

In [7]:
df[df['sex'] == ' Female']['age'].mean()

36.85823043357163

**3. Какова доля граждан Германии (признак native-country)?**

In [8]:
df['native-country'].value_counts(normalize=True)[' Germany']

0.004207487485028101

**4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак salary) и тех, кто получает менее 50K в год?**

In [9]:
df.groupby('salary')['age'].agg(['mean', 'std'])

             mean        std
salary
 <=50K  36.783738  14.020088
 >50K   44.249841  10.519028

**6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)**

In [12]:
df.query('salary == " >50K"')['education'].value_counts()

 Bachelors       2221
 HS-grad         1675
 Some-college    1387
 Masters          959
 Prof-school      423
 Assoc-voc        361
 Doctorate        306
 Assoc-acdm       265
 10th              62
 11th              60
 7th-8th           40
 12th              33
 9th               27
 5th-6th           16
 1st-4th            6
Name: education, dtype: int64

**7. Выведите статистику возраста для каждой расы (признак race) и каждого пола. Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Amer-Indian-Eskimo.**

In [13]:
df.groupby('race')['age'].describe()

,count,mean,std,min,25%,50%,75%,max
race,,,,,,,,
Amer-Indian-Eskimo,311.0,37.173633,12.447130,17.0,28.0,35.0,45.5,82.0
Asian-Pac-Islander,1039.0,37.746872,12.825133,17.0,28.0,36.0,45.0,90.0
Black,3124.0,37.767926,12.759290,17.0,28.0,36.0,46.0,90.0
Other,271.0,33.457565,11.538865,17.0,25.0,31.0,41.0,77.0
White,27816.0,38.769881,13.782306,17.0,28.0,37.0,48.0,90.0

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status)? Женатыми считаем тех, у кого marital-status начинается с Married (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [21]:
df['married'] =  df['marital-status'].apply(lambda x: True if x.split('-')[0] == ' Married' else False)

In [22]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,married
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,False
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,True
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,False
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,True
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,True

In [30]:
df.groupby(['married', 'salary'])['salary'].describe()

                count unique     top   freq
married salary
False    <=50K  16039      1   <=50K  16039
         >50K    1105      1    >50K   1105
True     <=50K   8681      1   <=50K   8681
         >50K    6736      1    >50K   6736

In [32]:
pd.crosstab(df['married'], df['salary'])

salary    <=50K   >50K
married
False     16039   1105
True       8681   6736

**9. Какое максимальное число часов человек работает в неделю (признак hours-per-week)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [39]:
df['hours-per-week'].max() # максимальное количество часов

99

In [40]:
df[df['hours-per-week'] == 99].shape[0] # столько людей работают максимальное количество часов

85

In [42]:
df[df['hours-per-week'] == 99]['salary'].value_counts(normalize=True) * 100 # процентное соотношение

 <=50K    70.588235
 >50K     29.411765
Name: salary, dtype: float64

**10. Посчитайте среднее время работы (hours-per-week) зарабатывающих мало и много (salary) для каждой страны (native-country).**

In [44]:
df.groupby(['native-country', 'salary'])[['hours-per-week']].mean()

                       hours-per-week
native-country salary
 ?              <=50K       40.164760
                >50K        45.547945
 Cambodia       <=50K       41.416667
                >50K        40.000000
 Canada         <=50K       37.914634
...                               ...
 United-States  >50K        45.505369
 Vietnam        <=50K       37.193548
                >50K        39.200000
 Yugoslavia     <=50K       41.600000
                >50K        49.500000

[82 rows x 1 columns]